Dynamo.Models.DynamoModel.OpenFileCommand.#ctor(System.String,System.Boolean)
Constructor
filePath: The path to the file.
forceManualExecutionMode: Should the file be opened in manual execution mode?

Dynamo.Models.DynamoModel.OpenFileCommand.#ctor(System.String,System.Boolean,System.Boolean)
Constructor
filePath: The path to the file.
forceManualExecutionMode: Should the file be opened in manual execution mode?
isTemplate: Is Dynamo opening a template file?