Dynamo.Graph.Nodes.CodeBlockNodeModel.SaveAndDeleteConnectors(System.Collections.IDictionary,System.Collections.IDictionary,System.Collections.IDictionary,System.Collections.IDictionary)
Deletes all the connections and saves their data (the start and end port)
so that they can be recreated if needed.
InportPins correspond to all connectorPins belonging to INports.
OutportPins correspond to all connectorpins belonging to OUTports.
inportConnections: A list of connections that will be destroyed
outportConnections:
inportPins:
outportPins:

Dynamo.Graph.Nodes.CodeBlockNodeModel.LoadAndCreateConnectors(System.Collections.Specialized.OrderedDictionary,System.Collections.Specialized.OrderedDictionary,System.Collections.Specialized.OrderedDictionary,System.Collections.Specialized.OrderedDictionary,Dynamo.Graph.SaveContext)
Now that the portData has been set for the new ports, we recreate the connections we
so mercilessly destroyed, restoring peace and balance to the world once again.
InportPins correspond to all connectorPins belonging to INports.
OutportPins correspond to all connectorpins belonging to OUTports.
inportConnections:
outportConnections:  List of the connections that were killed
inportPins:
outportPins:
context: context this operation is being performed in