Dynamo.Configuration.Configurations.AutodeskAsString
Const string of Autodesk

Dynamo.Configuration.Configurations.DynamoAsString
Const string of Dynamo

Dynamo.Configuration.Configurations.NotificationsDefaultTimeOut
Request timeOut for notifications service