Dynamo.Models.DynamoModel.GraphChecksumDictionary
Return a dictionary of GraphChecksumItems.
Key will be the workspace guid and its value will be a list of saved checksums(sha256 hash) for that workspace.

Dynamo.Models.DynamoModel.NoNetworkMode
True if Dynamo starts up in offline mode.

Dynamo.Models.DynamoModel.CERLocation
The Autodesk CrashReport tool location on disk (directory that contains the "cer.dll")

Dynamo.Models.DynamoModel.HandleFeatureFlags
When feature flags received, handle them and make changes

Dynamo.Models.DynamoModel.PostTraceReconciliation(System.Collections.Generic.Dictionary{System.Guid,System.Collections.Generic.List{System.String}})
Deals with orphaned serializables.
orphanedSerializables: Collection of orphaned serializables.

Dynamo.Models.DynamoModel.OpenTemplateFromPath(System.String,System.Boolean)
Opens a Dynamo workspace from a path to a template on disk.
filePath: Path to file
forceManualExecutionMode: Set this to true to discard
execution mode specified in the file and set manual mode

Dynamo.Models.DynamoModel.OpenJsonFileFromPath(System.String,System.String,System.Boolean,System.Boolean)
Opens a Dynamo workspace from a path to an JSON file on disk.
fileContents: Json file contents
filePath: Path to file
forceManualExecutionMode: Set this to true to discard
execution mode specified in the file and set manual mode
isTemplate: Set this to true to indicate that the file is a template
Returns: True if workspace was opened successfully

Dynamo.Models.DynamoModel.SetUICulture(System.String)
Set UI culture based on preferences

Dynamo.Models.DynamoModel.DisplayFutureFileMessage(System.String,System.Version,System.Version)
Displays file open error dialog if the file is of a future version than the currently installed version.
fullFilePath:
fileVersion:
currVersion:
Returns:  true if the file must be opened and false otherwise.