Dynamo.Graph.Workspaces.HomeWorkspaceModel.EnableLegacyPolyCurveBehavior
PolyCurve normal and direction behavior has been made predictable in Dynamo 3.0 and has therefore changed.
This reflects whether legacy (pre-3.0) PolyCurve behavior is selected either in preference settings or in the workspace.
A workspace setting if exists, overrides the default preference setting.

Dynamo.Graph.Workspaces.HomeWorkspaceModel.#ctor(Dynamo.Engine.EngineController,Dynamo.Scheduler.DynamoScheduler,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,System.Collections.Generic.IEnumerable{System.Collections.Generic.KeyValuePair{System.Guid,System.Collections.Generic.List{ProtoCore.CallSite.RawTraceData}}},System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Annotations.AnnotationModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Presets.PresetModel},ProtoCore.Namespace.ElementResolver,Dynamo.Graph.Workspaces.WorkspaceInfo,System.Boolean,System.Boolean,Dynamo.Linting.LinterManager)
Initializes a new instance of the Dynamo.Graph.Workspaces.HomeWorkspaceModel class
by given information about it and specified item collections
engine: Dynamo.Graph.Workspaces.HomeWorkspaceModel.EngineController object assosiated with this home workspace
to coordinate the interactions between some DesignScript sub components.
scheduler: Dynamo.Scheduler.DynamoScheduler object to add tasks in queue to execute
factory: Node factory to create nodes
traceData: Preloaded trace data
nodes: Node collection of the workspace
notes: Note collection of the workspace
annotations: Group collection of the workspace
presets: Preset collection of the workspace
resolver: ElementResolver responsible for resolving
a partial class name to its fully resolved name
info: Information for creating custom node workspace
verboseLogging: Indicates if detailed descriptions should be logged
isTestMode: Indicates if current code is running in tests
linterManager: The linter manager from the DynamoModel that owns this workspace

Dynamo.Graph.Workspaces.HomeWorkspaceModel.GetOrphanedSerializablesAndClearHistoricalTraceData
Returns a list of string items which exist in the preloaded
trace data but do not exist in the current CallSite data.
Returns: