Dynamo.Logging.AnalyticsService.KeepAlive
Indicates that we don't want to shut down analytics when DynamoModel shuts down.
Sometimes we want to keep Analytics service running even when we don't have a DynamoModel started.

Dynamo.Logging.AnalyticsService.Start
Starts the Analytics client. This method initializes
the Analytics service and application life cycle start is tracked.

Dynamo.Logging.AnalyticsService.ShowADPConsentDialog(System.Nullable{System.IntPtr})
Show the ADP dynamic consents dialog.
host: main window