Dynamo.Utilities.LuceneStartConfig
Start up config for Lucene indexing

Dynamo.Utilities.LuceneStartConfig.Directory
Lucene Index Directory name, e.g. Nodes, Packages

Dynamo.Utilities.LuceneStartConfig.StorageType
Current Lucene Index Storage type, it could be either RAM or FILE_SYSTEM

Dynamo.Utilities.LuceneStartConfig.#ctor(Dynamo.Utilities.LuceneSearchUtility.LuceneStorage,System.String)
Constructor for LuceneStartConfig
directory:
storageType: