Dynamo.Models.NodeModelAssemblyLoader.LoadedAssemblyNames
Used at startup to avoid reloading NodeModels from assemblies that have already been loaded.
Is NOT kept in sync with latest loaded assemblies - use LoadedAssemblies Property for that.
TODO refactor and use LoadedAssemblies instead