Dynamo.Graph.Workspaces.WorkspaceModel.ContainsLegacyTraceData
This is true only if the workspace contains legacy SOAP formatted binding data.

Dynamo.Graph.Workspaces.WorkspaceModel.IsTemplate
Denotes if the current workspace was created from a template.

Dynamo.Graph.Workspaces.WorkspaceModel.FromJsonGraphId
A unique id representing a workspace that was created from an in-memory graph content.
This is usefull if you need to check if the current workspace was initially created from
a specific graph content. As oposed to graph uuid, FromJsonGraphId is not serialized and it
only makes sense (and is computed) at runtime when we OpenFileFromJson. Because of that
we eliminate the risk of having this value modified outside Dynamo environment.

Dynamo.Graph.Workspaces.WorkspaceModel.RemoveAndDisposeNode(Dynamo.Graph.Nodes.NodeModel,System.Boolean)
Removes a node from this workspace.
This method does not raise a NodesModified event. (LC notes this is clearly not true)
model: The node which is being removed from the worksapce.
dispose:

Dynamo.Graph.Workspaces.WorkspaceModel.HasWarnings
Boolean indicates if the workspace run with warnings

Dynamo.Graph.Workspaces.WorkspaceModel.HasNoneGeometryRelatedWarnings
Boolean indicates if the workspace run with warnings with no Geometry

Dynamo.Graph.Workspaces.WorkspaceModel.HasErrors
Boolean indicates if workspace run with errors

Dynamo.Graph.Workspaces.WorkspaceModel.HasInfos
Boolean indicates if home workspace is displayed with infos

Dynamo.Graph.Workspaces.WorkspaceModel.IsValidForFDX
Indicates if the workspace is valid for sending to the FDX