Dynamo.Utilities.LuceneSearchUtility
Lucene search utility class that will be used for indexing and searching nodes and packages

Dynamo.Utilities.LuceneSearchUtility.addedFields
Index fields that were added to the document

Dynamo.Utilities.LuceneSearchUtility.dirReader
Lucene Directory Reader

Dynamo.Utilities.LuceneSearchUtility.indexDir
Lucene Index Directory, it can be RAMDirectory or FSDirectory

Dynamo.Utilities.LuceneSearchUtility.writer
Lucene Index write

Dynamo.Utilities.LuceneSearchUtility.startConfig
Start config for Lucene

Dynamo.Utilities.LuceneSearchUtility.DefaultStartConfig
Default start config for Lucene, it will use RAM storage type and empty directory

Dynamo.Utilities.LuceneSearchUtility.DefaultNodeIndexStartConfig
Start config for node index, it will use file storage type and node index directory

Dynamo.Utilities.LuceneSearchUtility.DefaultPkgIndexStartConfig
Start config for package index, it will use file storage type and package index directory

Dynamo.Utilities.LuceneSearchUtility.#ctor(Dynamo.Models.DynamoModel,Dynamo.Utilities.LuceneStartConfig)
Constructor for LuceneSearchUtility, it will use the storage type passed as parameter
model:
config:

Dynamo.Utilities.LuceneSearchUtility.InitializeLuceneConfig
Initialize Lucene index writer based on start config.

Dynamo.Utilities.LuceneSearchUtility.CreateLuceneIndexWriter(Lucene.Net.Index.OpenMode)
Create index writer for followup doc indexing
mode: Index open mode for Lucene index writer

Dynamo.Utilities.LuceneSearchUtility.SetDocumentFieldValue(Lucene.Net.Documents.Document,System.String,System.String,System.Boolean,System.Boolean,System.Boolean)
The SetDocumentFieldValue method should be optimized later
doc: Lucene document in which the information is stored
field: Field that is being updated in the document
value: Field value
isTextField: This is used when the value need to be tokenized(broken down into pieces), whereas StringTextFields are tokenized.
isLast: This is used for the last value set in the document. It will fetch all the fields not set in the document and add them with an empty string.
isTSpline: Indicate if the field being indexed belongs to a T-Spline node or not

Dynamo.Utilities.LuceneSearchUtility.IsMatchingCategory(System.String,System.String)
Check if the term passed as parameter is found inside the FullCategoryName
term: Splitted search term e.g. if the search term is "set parameter" the parameter will be "set" or "parameter"
FullCategoryName: The complete category used for a specific node, like Core.File.FileSystem
Returns:

Dynamo.Utilities.LuceneSearchUtility.DisposeWriter
Dispose Lucene index write objects and reuse other objects

Dynamo.Utilities.LuceneSearchUtility.DisposeAll
Dispose all the Lucene objects

Dynamo.Utilities.LuceneSearchUtility.CommitWriterChanges
Commit the changes made to the Lucene index

Dynamo.Utilities.LuceneSearchUtility.AddNodeTypeToSearchIndex(Dynamo.Search.SearchElements.NodeSearchElement,Lucene.Net.Documents.Document)
Add node information to existing Lucene index
node: node info that will be indexed
doc: Lucene document in which the node info will be indexed