Dynamo.Core.MigrationPathResolver.GetDynamoUserDataLocations
Returns the full path of user data location of all version of this
Dynamo product installed on this system. The default implementation
returns list of all subfolders in %appdata%\Dynamo as well as
%appdata%\Dynamo\Dynamo Core\ folders.
Returns: