Dynamo.Graph.Nodes.CodeBlockUtils.GetStatementVariables(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.Statement})
Call this method to get a list of lists of variables defined in
the given set of Statement objects.
statements: A list of Statement objects whose defined
variables are to be retrieved. This list can be empty but it cannot
be null.
Returns: Returns a list of lists of variables defined by the given
set of Statement objects.