Dynamo.Logging.DynamoAnalyticsClient.#ctor(Dynamo.Models.HostAnalyticsInfo)
Constructs DynamoAnalyticsClient from existing HostAnalyticsInfo

Dynamo.Logging.DynamoAnalyticsClient.TrackActivityStatus(System.String)
This API is used to track user/machine's activity status.
Note: This will not trigger the API at each call, instead it will
send out one call for every 4(HeartBeatInterval) minutes for each user and machine type activity.
For example, if the method gets called 100 times in 8 minutes, then it will only
trigger the HeartBeat API twice. This is to avoid sending out too many calls
as the API expects a call every 5 minutes, to mark the user/machine active.
activityType: Value must be either Machine or User. If no value is provided the API will default to user activity type.