Dynamo.Search.EntryDictionary`1
The search API in this class has been replaced with the Lucene search.
A dictionary of objects.

Dynamo.Search.EntryDictionary`1.#ctor(Dynamo.Logging.ILogger)
Construct a EntryDictionary object
logger:  (Optional) A logger to use to log entry data

Dynamo.Search.EntryDictionary`1.entryDictionary
Dictionary of entry Element:(tag, weight)

Dynamo.Search.EntryDictionary`1.tagDictionary
Dictionary of tag:(list(element, weight)) which contains all nodes that share a tag

Dynamo.Search.EntryDictionary`1.Entries
All the current entries.

Dynamo.Search.EntryDictionary`1.NumTags
The number of tags in the dictionary

Dynamo.Search.EntryDictionary`1.NumElements
The number of elements in the dictionary

Dynamo.Search.EntryDictionary`1.EntryAdded
Event is fired when an entry is added.

Dynamo.Search.EntryDictionary`1.EntryRemoved
Event is fired when an entry is removed.

Dynamo.Search.EntryDictionary`1.EntryUpdated
Event is fired when an entry is updated.

Dynamo.Search.EntryDictionary`1.Add(`0,System.String,System.Double)
Add a single element with a single tag
value:  The object to add
tag:  The string to identify it
weight:

Dynamo.Search.EntryDictionary`1.Add(System.Collections.Generic.IEnumerable{`0},System.String,System.Double)
Add a list of elements with a single tag
values:  List of objects to add
tag:  The string to identify it
weight:

Dynamo.Search.EntryDictionary`1.Add(`0,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Double})
Add a single element with a number of tags
value:  The object to add
tags:  The list of strings to identify it
weights: The list of corresponding weights coefficients

Dynamo.Search.EntryDictionary`1.Add(System.Collections.Generic.IEnumerable{`0},System.Collections.Generic.IEnumerable{System.String},System.Double)
Add a coordinated list of objects and strings.
values:  The objects to add. Must have the same cardinality as the second parameter
tags:  The list of strings to identify it in search. Must have the same cardinality as the first parameter
weight:

Dynamo.Search.EntryDictionary`1.Remove(`0,System.String)
Remove an element from the dictionary.
value:  The object to remove
tag: The tag to remove for the given value

Dynamo.Search.EntryDictionary`1.Remove(`0)
Remove an element from the dictionary
value:  The object to remove

Dynamo.Search.EntryDictionary`1.Remove(System.Func{`0,System.Boolean})
Remove elements from dictionary based on a predicate
removeCondition:  The predicate with which to test.  True results in removal.

Dynamo.Search.EntryDictionary`1.Remove(System.Func{`0,System.Boolean},System.Func{System.String,System.Boolean})
Removes elements from dictionary, based on separate predicates for values and tags.
valueCondition:
removeTagCondition:
Returns:

Dynamo.Search.EntryDictionary`1.Remove(`0,System.Collections.Generic.IEnumerable{System.String})
Remove elements from dictionary
value:  The object to remove
tags:  The list of tags to remove.

Dynamo.Search.EntryDictionary`1.ByTag(System.String)
Returns the elements with a given tag
tag:  The tag to match
Returns:  The elements with the given tag

Dynamo.Search.EntryDictionary`1.Contains(`0)
Determines if this EntryDictionary contains a specific element.
a:
Returns: