Dynamo.Core.PathManager.PathResolver
PathResolver is used to resolve paths for custom nodes, packages, and preloaded libraries.

Dynamo.Core.PathManager.TemplatesDirectory
Dynamo Templates folder

Dynamo.Core.PathManager.DefaultTemplatesDirectory
Default templates directory, it is used when the user resets the custom template path

Dynamo.Core.PathManager.GetProductVersion
Returns the current Dynamo product version.
Returns:

Dynamo.Core.PathManager.GetTemplateFolder(System.String)
Get template folder path from common data directory
dataRootDirectory:
Returns: