Dynamo.Core.DynamoMigratorBase.MigrateBetweenDynamoVersions(Dynamo.Interfaces.IPathManager)
Migrates preference settings and copies packages and custom node
definitions from the last but one version to the currently installed Dynamo version
pathManager:
Returns: new migrator instance after migration

Dynamo.Core.DynamoMigratorBase.GetLatestVersionToMigrate(Dynamo.Interfaces.IPathManager,Dynamo.Core.FileVersion)
Returns the most recent version to migrate to the given current version.
pathManager:
currentVersion:
Returns: FileVersion?

Dynamo.Core.DynamoMigratorBase.GetInstalledVersions(Dynamo.Interfaces.IPathManager)
Returns list of FileVersion objects, given the IPathManager.
pathManager:
Returns: