Dynamo.Graph.Nodes.ZeroTouch.DSFunction.#ctor(Dynamo.Engine.FunctionDescriptor)
Initializes a new instance of the Dynamo.Graph.Nodes.ZeroTouch.DSFunction class.
functionDescription: Function descritor.