Dynamo.Graph.Workspaces.IdReferenceResolver.AddToReferenceMap(System.Guid,System.Object)
Add a reference to a newly created object, referencing
an old id.
oldId: The old id of the object.
newObject: The new object which maps to the old id.