Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1.#ctor(`0)
Initializes a new instance of
the Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchNodeController`1 class with FunctionDescriptor.
definition: FunctionDescriptor describing the function
that this controller will call.