Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchVarArgNodeController`1.#ctor(`0)
Initializes a new instance of
the Dynamo.Graph.Nodes.ZeroTouch.ZeroTouchVarArgNodeController`1 class with FunctionDescriptor.
zeroTouchDef: FunctionDescriptor describing the function
that this controller will call.