Dynamo.Graph.Nodes.Utilities.LoadTraceDataFromXmlDocument(System.Xml.XmlDocument,System.Boolean@)
Call this method to load serialized node-data-list pairs (through a
prior call to SaveTraceDataToXmlDocument) from a given XmlDocument.
document: The XmlDocument from which serialized node-
data-list pairs are to be deserialized.
Returns: Returns a dictionary of deserialized node-data-list pairs
loaded from the given XmlDocument.