Dynamo.Configuration.PreferenceSettings.Instance
Return a PreferenceSetting object.  The object returned is based on the following conditions:
1) if DynamoModel present, the DynamoModel.PreferenceSettings object is returned,
2) else, if a valid setting xml file exists, the PreferenceSettings object de-serialized from the xml file is returned,
3) else, if no DynamoModel and no valid xml file exists, a new PreferenceSettings object returned
Note that Instance is a runtime object only.  No changes to the PreferenceSettings will be persisted on disk with condition 2 or 3.
User of Instance must initiate save operations to insure persistence of modifications to the PreferenceSettings model.
In some cases even the save will not guarantee persistence of modifications depending on the startup of DynamoModel.

Dynamo.Configuration.PreferenceSettings.UseRenderInstancing
Indicates whether background preview use instancing when rendering geometry.
be rendered.

Dynamo.Configuration.PreferenceSettings.TemplateFilePath
Template path

Dynamo.Configuration.PreferenceSettings.GraphChecksumItemsList
Return a list of GraphChecksumItems

Dynamo.Configuration.PreferenceSettings.DefaultEnableLegacyPolyCurveBehavior
PolyCurve normal and direction behavior has been made predictable in Dynamo 3.0 and has therefore changed.
This defines whether legacy (pre-3.0) PolyCurve behavior is selected by default.
This flag can be overridden by individual workspaces that have the EnableLegacyPolyCurveBehavior flag defined.
Note: For internal use only and will be removed in a future version of Dynamo.

Dynamo.Configuration.PreferenceSettings.IsMLAutocompleteTOUApproved
This defines if the user is agree to the ML Automcomplete Terms of Use

Dynamo.Configuration.PreferenceSettings.nodeSearchTagSizeLimit
Limits the size of the tags used by the EntryDictionary
This static property is not serialized and is assigned NodeSearchTagSizeLimit's value
if found at deserialize time.

Dynamo.Configuration.PreferenceSettings.NodeSearchTagSizeLimit
Limits the size of the tags used by the EntryDictionary

Dynamo.Configuration.PreferenceSettings.ironPythonResolveTargetVersion
The Version of the IronPython package that Dynamo will download when it is found as missing in graphs.
This property is not serialized and is assigned IronPythonResolveTargetVersion's value
if found at deserialize time.

Dynamo.Configuration.PreferenceSettings.EnableDynamoPlayerRenamedWatchAsOutput
Enable legacy behavior for Dynamo Player to allow renamed Watch nodes to be seen as graph output.
This flag is for use in the 2024 product release year and can removed for 2025

Dynamo.Configuration.PreferenceSettings.InitializeNamespacesToExcludeFromLibrary
Initialize namespaces to exclude from Library based on conditions

Dynamo.Configuration.PreferenceSettings.UpdateNamespacesToExcludeFromLibrary
Update namespaces to exclude from Library based on feature flags