Dynamo.Graph.Nodes.NodeModel.SelectNeighbors
Selects all neighboring nodes ans connector pins to this node

Dynamo.Graph.Nodes.NodeModel.RegisterInputPorts(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortData})
Reads inputs list and adds ports for each input.
TODO: DYN-6445 - evaluate if this API can be removed.

Dynamo.Graph.Nodes.NodeModel.RegisterOutputPorts(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.PortData})
Reads outputs list and adds ports for each output
TODO: DYN-6445 - evaluate if this API can be removed.