Dynamo.Graph.Workspaces.NodeReadConverter.RemapPorts(Dynamo.Graph.Nodes.NodeModel,Dynamo.Graph.Nodes.PortModel[],Dynamo.Graph.Nodes.PortModel[],Dynamo.Graph.Workspaces.IdReferenceResolver,Dynamo.Logging.ILogger)
Map old Guids to new Models in the IdReferenceResolver.
This method also sets portData from the deserialized ports onto the
newly created ports.
node: The newly created node.
inPorts: The deserialized input ports.
outPorts: The deserialized output ports.
resolver: The IdReferenceResolver used during deserialization.
logger: