Dynamo.Graph.Workspaces.LayoutExtensions.DoGraphAutoLayout(Dynamo.Graph.Workspaces.WorkspaceModel,System.Boolean,System.Boolean,System.Nullable{System.Guid})
This function wraps a few methods on the workspace model layer
to set up and run the graph layout algorithm.
workspace: Workspace on which graph layout will be performed.
reuseUndoRedoGroup: If true, skip initializing new undo action group.
isNodeAutoComplete:
originalNodeGUID:

Dynamo.Graph.Workspaces.LayoutExtensions.AddConnectorEdgesIncludingPinEdges(GraphLayout.Graph,Dynamo.Graph.Connectors.ConnectorModel,System.Nullable{System.Guid},System.Nullable{System.Guid})
If a connector has connectorPins, their edges get added to the combined graph.
combinedGraph:
connector:
start:
end: