Dynamo.Linting.Rules.NodeLinterRule.Evaluate(Dynamo.Graph.Nodes.NodeModel,System.String)
Method to call when this rule needs to be evaluated.
This will use Dynamo.Linting.Rules.NodeLinterRule.EvaluateFunction(Dynamo.Graph.Nodes.NodeModel,System.String) to evaluate the rule.
nodeModel:
changedEvent: