Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.NameSplitted
NameSplitted - The name of the node splitted using just the last part (e.g. List.Chop we will be using just Chop)

Dynamo.Configuration.LuceneConfig.NodeFieldsEnum.CategorySplitted
CategorySplitted - For this case we will be using just the last Category (the last word after the dot separator in FullCategoryName)