Dynamo.Linting.Rules.GraphLinterRule.Evaluate(Dynamo.Graph.Workspaces.WorkspaceModel,System.String,Dynamo.Graph.Nodes.NodeModel)
Method to call when this rule needs to be evaluated.
This will use Dynamo.Linting.Rules.GraphLinterRule.EvaluateFunction(Dynamo.Graph.Workspaces.WorkspaceModel,System.String,Dynamo.Graph.Nodes.NodeModel) to evaluate the rule.
workspaceModel:
changedEvent:
modifiedNode: