Dynamo.Models.DynamoModel.IStartConfiguration.NoNetworkMode
Configuration option to start Dynamo in offline mode.

Dynamo.Models.DynamoModel.IStartConfiguration.HostAnalyticsInfo
Configuration object that contains host information like Host name, parent id and session id.