Dynamo.Interfaces.IPathResolver.GetDynamoUserDataLocations
Returns a list of user data folders on this system.
Returns:
The implementation of this interface method should return a list of user
data folders, one for each of Dynamo product installed on the system. When
there is no Dynamo product installed, this method returns an empty list.