Dynamo.Migration.MigrationManager.CreateVarArgFunctionNode(System.Xml.XmlDocument,System.Xml.XmlElement,System.Int32,System.String,System.String,System.String,System.String)
Call this method to create an empty DSVarArgFunction node that contains
basic function node information.
document: The XmlDocument to create the node in.
oldNode: Base node to create a new one
nodeIndex: Index of the node
assembly: Name of the assembly that implements this
function.
name: The name to display on the node.
signature: The signature of the function.
inputcount:
Returns: Returns the XmlElement that represents a DSVarArgFunction node
with its basic function information with default attributes.