Dynamo.Linting.Rules.LinterRule.InitializeBase(Dynamo.Graph.Workspaces.WorkspaceModel)
Initializes this rule using the Dynamo.Linting.Rules.LinterRule.InitializeRule(Dynamo.Graph.Workspaces.WorkspaceModel)
workspaceModel:
Returns: